[
  {
    "id": 201,
    "nameEn": "Silver Charm Necklace",
    "nameAr": "قلادة سحر فضية",
    "price": 499,
    "imageUrl": "https://images.pexels.com/photos/135620/pexels-photo-135620.jpeg",
    "isBestSeller": true,
    "isSpecialGift": true,
    "categoryId": "jewelry",
    "occasionId": "anniversary",
    "descriptionEn": "A delicate silver necklace with a timeless charm, perfect for gifting. Crafted from premium sterling silver with intricate detailing, this piece combines elegance with durability. The adjustable chain ensures a perfect fit, making it suitable for any occasion.",
    "descriptionAr": "قلادة فضية دقيقة بسحر خالد، مثالية للهدايا. مصنوعة من الفضة الإسترلينية المميزة بتفاصيل معقدة، هذه القطعة تجمع بين الأناقة والمتانة. السلسلة القابلة للتعديل تضمن ملاءمة مثالية، مما يجعلها مناسبة لأي مناسبة."
  },
  {
    "id": 202,
    "nameEn": "Gold Plated Earrings",
    "nameAr": "أقراط مطلية بالذهب",
    "price": 349,
    "imageUrl": "https://images.pexels.com/photos/1395306/pexels-photo-1395306.jpeg",
    "isBestSeller": false,
    "isSpecialGift": true,
    "categoryId": "jewelry",
    "occasionId": "graduation",
    "descriptionEn": "Elegant gold plated earrings that add sophistication to any outfit. These stunning pieces feature a classic design with modern touches, perfect for both casual and formal occasions. The hypoallergenic coating ensures comfort for sensitive ears.",
    "descriptionAr": "أقراط أنيقة مطلية بالذهب تضيف الأناقة لأي إطلالة. هذه القطع المذهلة تتميز بتصميم كلاسيكي مع لمسات عصرية، مثالية للمناسبات الرسمية وغير الرسمية. الطلاء المضاد للحساسية يضمن الراحة للأذن الحساسة."
  },
  {
    "id": 203,
    "nameEn": "Pearl Bracelet Set",
    "nameAr": "طقم أساور لؤلؤ",
    "price": 299,
    "imageUrl": "https://images.pexels.com/photos/1395306/pexels-photo-1395306.jpeg",
    "isBestSeller": false,
    "isSpecialGift": false,
    "categoryId": "jewelry",
    "occasionId": "wedding",
    "descriptionEn": "A beautiful set of pearl bracelets for elegant occasions. Each bracelet features genuine cultured pearls with lustrous finish, connected by delicate silver links. This timeless set adds grace and sophistication to any ensemble.",
    "descriptionAr": "طقم جميل من أساور اللؤلؤ للمناسبات الأنيقة. كل سوار يحتوي على لؤلؤ مزروع أصلي بلمعة براقة، متصل بوصلات فضية دقيقة. هذا الطقم الخالد يضيف النعمة والأناقة لأي مجموعة."
  }
]
